; domain
(define (domain domainXY)

    (:requirements :equality :disjunctive-preconditions :negative-preconditions :typing :conditional-effects
    )

    (:types
        vehicle position direction - object
        car truck motorcycle - vehicle
    )

    (:predicates
        (at ?v - vehicle ?x - position ?y - position)
        (occupied ?x - position ?y - position)
        (next ?next - position ?pre - position) ; Per dire che x2 viene dopo x1, (next x2 x1)
    )

    ; Motorcycle = 1 position
    ; Parameters:
    ; - ?m : the motorcycle to be moved
    ; - ?x ?y : the current position of the motorcycle
    ; - ?xDest : the x coordinate where the motorcycle will be moved
    ;
    ; Precondition
    ; - The motorcycle has to be in ?x ?y
    ; - The coordinate ?xDest should be free (not occupied)
    ; - If ?xDest is greater than ?x, the motorcycle will move down;
    ; - If ?x is greater than ?xDest, the motorcycle will move up;
    ;
    ; Effects:
    ; - The motorcycle will be at ?xDest ?y, which results to be occupied, 
    ;   and will not be at ?x ?y, which will be not occupied.

    (:action move-motorcycle-ver
        :parameters (?m - motorcycle ?x - position ?y - position ?xDest - position)
        :precondition (and
            (at ?m ?x ?y)
            (not (occupied ?xDest ?y))
            (or (next ?xDest ?x) (next ?x ?xDest))
        )
        :effect (and
            (at ?m ?xDest ?y)
            (occupied ?xDest ?y)
            (not (at ?m ?x ?y))
            (not (occupied ?x ?y))
        )
    )

    ; Motorcycle = 1 position
    ; Parameters:
    ; - ?m : the motorcycle to be moved
    ; - ?x ?y : the current position of the motorcycle
    ; - ?yDest : the y coordinate where the motorcycle will be moved
    ;
    ; Precondition
    ; - The motorcycle has to be in ?x ?y
    ; - The coordinate ?yDest should be free (not occupied)
    ; - If ?yDest is greater than ?y, the motorcycle will move right;
    ; - If ?y is greater than ?yDest, the motorcycle will move left;
    ;
    ; Effects:
    ; - The motorcycle will be at ?x ?yDest, which results to be occupied, 
    ;   and will not be at ?x ?y, which will be not occupied.

    (:action move-motorcycle-hor
        :parameters (?m - motorcycle ?x - position ?y - position ?yDest - position)
        :precondition (and
            (at ?m ?x ?y)
            (not (occupied ?x ?yDest))
            (or (next ?yDest ?y) (next ?y ?yDest))

        )
        :effect (and
            (at ?m ?x ?yDest)
            (occupied ?x ?yDest)
            (not (at ?m ?x ?y))
            (not (occupied ?x ?y))
        )
    )

    ; Car = 2 positions
    ; Parameters:
    ; - ?c : the car to be moved
    ; - ?x1 ?y and ?x2 ?y : the current positions of the car
    ; - ?xDest : the x coordinate where the car will be moved
    ;
    ; Precondition
    ; - The car has to be in ?x1 ?y and ?x2 ?y 
    ; - ?x1 and ?x2 should be different
    ; - The coordinate ?xDest should be free (not occupied)
    ; - ?x2 has to be greater than ?x1
    ; - If ?x1 is greater than ?xDest, the car will move up
    ; - If ?xDest is greater than ?x, the car will move down
    ;
    ; Effects:
    ; - If the car is moving up, it will be at ?xDest ?y and ?x1 ?y, which result to be occupied 
    ;   and will not be at ?x2 ?y anymore

    (:action move-car-ver
        :parameters (?c - car ?y - position ?x1 - position ?x2 - position ?xDest - position)
        :precondition (and
            (at ?c ?x1 ?y)
            (at ?c ?x2 ?y)
            (not (occupied ?xDest ?y))
            (not (= ?x1 ?x2))
            (next ?x2 ?x1) 
            (or (next ?x1 ?xDest) (next ?xDest ?x2))

        )
        :effect (and

            (when
                (and
                    (next ?x1 ?xDest) ; Up 
                )
                (and
                    (at ?c ?xDest ?y)
                    (at ?c ?x1 ?y)
                    (occupied ?xDest ?y)
                    (not (at ?c ?x2 ?y))
                    (not (occupied ?x2 ?y))
                )
            )

            (when
                (and
                    (next ?xDest ?x2) ; Down
                )
                (and
                    (at ?c ?xDest ?y)
                    (at ?c ?x2 ?y)
                    (occupied ?xDest ?y)
                    (not (at ?c ?x1 ?y))
                    (not (occupied ?x1 ?y))
                )
            )

        )
    )
    
    ; ; Car = 2 positions
    ; ; Parameters:
    ; ; - ?c : the car to be moved
    ; ; - ?p1 ?p2 : the current position of the car
    ; ; - ?pDest : the position where the car will be moved
    ; ;
    ; ; Precondition
    ; ; - The car has to be in ?p1 and ?p2
    ; ; - ?p1 and ?p2 should be different
    ; ; - The position ?pDest should be free (not occupied)
    ; ;
    ; ; Effect
    ; ; - If there is an horizontal connection between ?p1 and ?p2, then the car will move horizontally. 
    ; ; - If there is an horizontal connection between ?p1 and ?pDest, then the car will be at ?pDest and ?p1 and will not be at ?p2 anymore.
    ; ; - If there is an horizontal connection between ?p2 and ?pDest, then the car will be at ?pDest and ?p2 and will not be at ?p1 anymore.

    (:action move-car-hor
        :parameters (?c - car ?x - position ?y1 - position ?y2 - position ?yDest - position)
        :precondition (and
            (at ?c ?x ?y1)
            (at ?c ?x ?y2)
            (not (occupied ?x ?yDest))
            (not (= ?y1 ?y2))
            (next ?y2 ?y1)
            (or (next ?y1 ?yDest) (next ?yDest ?y2))

        )
        :effect (and
            (when
                (and (next ?y1 ?yDest)) ; Left
                (and
                    (at ?c ?x ?yDest)
                    (at ?c ?x ?y1)
                    (occupied ?x ?yDest)
                    (not (at ?c ?x ?y2))
                    (not (occupied ?x ?y2))
                )
            )

            (when
                (and (next ?yDest ?y2)) ; Right
                (and
                    (at ?c ?x ?yDest)
                    (at ?c ?x ?y2)
                    (occupied ?x ?yDest)
                    (not (at ?c ?x ?y1))
                    (not (occupied ?x ?y1))
                )
            )

        )
    )

    ; ; Truck = 3 positions
    ; ; Parameters:
    ; ; - ?t : the truck to be moved
    ; ; - ?p1 ?p2 ?p3: the current positions of the truck
    ; ; - ?pDest : the position where the truck will be moved
    ; ;
    ; ; Precondition
    ; ; - The truck has to be in ?p1, ?p2 and ?p3
    ; ; - ?p1, ?p2 and ?p3 should be different
    ; ; - The position ?pDest should be free (not occupied)
    ; ;
    ; ; Effect
    ; ; - If there is an vertical connection between ?p and ?p2 and between ?p2 and ?p3, then the truck will move vertically. 
    ; ; - If there is an vertical connection between ?p1 and ?pDest, then the truck will be at ?pDest, ?p1 and ?p2 and will not be at ?p3 anymore.
    ; ; - If there is an vertical connection between ?p3 and ?pDest, then the truck will be at ?pDest, ?p3 and ?p2 and will not be at ?p1 anymore.

    (:action move-truck-ver
        :parameters (?t - truck ?y - position ?x1 - position ?x2 - position ?x3 - position ?xDest - position)
        :precondition (and
            (at ?t ?x1 ?y)
            (at ?t ?x2 ?y)
            (at ?t ?x3 ?y)
            (not (occupied ?xDest ?y))
            (not (= ?x1 ?x2))
            (not (= ?x2 ?x3))
            (not (= ?x1 ?x3))

            (and (next ?x2 ?x1) (next ?x3 ?x2))
            (or (next ?x1 ?xDest) (next ?xDest ?x3))

        )
        :effect (and

            (when
                (and (next ?x1 ?xDest)) ; Up

                (and
                    (at ?t ?xDest ?y)
                    (at ?t ?x1 ?y)
                    (at ?t ?x2 ?y)
                    (occupied ?xDest ?y)
                    (not (at ?t ?x3 ?y))
                    (not (occupied ?x3 ?y))
                )
            )

            (when

                (and (next ?xDest ?x3)) ; Down

                (and
                    (at ?t ?xDest ?y)
                    (at ?t ?x3 ?y)
                    (at ?t ?x2 ?y)
                    (occupied ?xDest ?y)
                    (not (at ?t ?x1 ?y))
                    (not (occupied ?x1 ?y))
                )
            )

        )
    )
    
    ; ; Truck = 3 positions
    ; ; Parameters:
    ; ; - ?t : the truck to be moved
    ; ; - ?p1 ?p2 ?p3: the current positions of the truck
    ; ; - ?pDest : the position where the truck will be moved
    ; ;
    ; ; Precondition
    ; ; - The truck has to be in ?p1, ?p2 and ?p3
    ; ; - ?p1, ?p2 and ?p3 should be different
    ; ; - The position ?pDest should be free (not occupied)
    ; ;
    ; ; Effect
    ; ; - If there is an horizontal connection between ?p1 and ?p2 and between ?p2 and ?p3, then the truck will move horizontally. 
    ; ; - If there is an horizontal connection between ?p1 and ?pDest, then the truck will be at ?pDest, ?p1 and ?p2 and will not be at ?p3 anymore.
    ; ; - If there is an horizontal connection between ?p3 and ?pDest, then the truck will be at ?pDest, ?p3 and ?p2 and will not be at ?p1 anymore.

    (:action move-truck-hor
        :parameters (?t - truck ?x - position ?y1 - position ?y2 - position ?y3 - position ?yDest - position)
        :precondition (and
            (at ?t ?x ?y1)
            (at ?t ?x ?y2)
            (at ?t ?x ?y3)
            (not (occupied ?x ?yDest))
            (not (= ?y1 ?y2))
            (not (= ?y2 ?y3))
            (not (= ?y1 ?y3))
            (and (next ?y2 ?y1) (next ?y3 ?y2))
            (or (next ?y1 ?yDest) (next ?yDest ?y3))
        )
        :effect (and
            (when

                (and (next ?y1 ?yDest)) ; Left

                (and
                    (at ?t ?x ?yDest)
                    (at ?t ?x ?y1)
                    (at ?t ?x ?y2)
                    (occupied ?x ?yDest)
                    (not (at ?t ?x ?y3))
                    (not (occupied ?x ?y3))
                )
            )

            (when

                (and (next ?yDest ?y3)) ; Right

                (and
                    (at ?t ?x ?yDest)
                    (at ?t ?x ?y3)
                    (at ?t ?x ?y2)
                    (occupied ?x ?yDest)
                    (not (at ?t ?x ?y1))
                    (not (occupied ?x ?y1))
                )
            )
        )
    )

)

; problem
(define (problem problem10x10) (:domain domainXY)

    ; --------------------------------------------
    ;     1   2   3   4   5   6   7   8   9   10
    ; 1 |   |   |   |   |   |   |   |   |   |   |
    ; 2 |   |   | m3|   |   |   |   |m6 |   |   |
    ; 3 |   | m2| t |   |   |m4 |   |   |   |   |
    ; 4 |   |   | r | c | 5 | t | r | 2 | c | 6 |
    ; 5 |   |   | 1 | re| d | c |   |   | X |   |
    ; 6 |   |   | c | 1 | c | 4 |   | t |m5 |   |
    ; 7 |   |   |   |   | 2 | c | 3 | r |   |   |
    ; 8 |   |   |   |   |   |   |   | 3 |   |   |
    ; 9 |   |   |m1 |   | t | r | 4 |m7 |   |   |
    ; 10|   |   |   |   |   |   |   |   |   |   |
    ; ---------------------------------------------

    (:objects
        m1 m2 m3 m4 m5 m6 m7 - motorcycle
        c1 c2 c3 c4 c5 c6 red - car
        t1 t2 t3 t4 - truck
        x1 x2 x3 x4 x5 x6 x7 x8 x9 x10 y1 y2 y3 y4 y5 y6 y7 y8 y9 y10 - position
    )
    
    (:init
        (next x2 x1) 
        (next x3 x2)
        (next x4 x3)
        (next x5 x4)
        (next x6 x5)
        (next x7 x6) 
        (next x8 x7)
        (next x9 x8)
        (next x10 x9)
        
        (next y2 y1) 
        (next y3 y2)
        (next y4 y3)
        (next y5 y4)
        (next y6 y5)
        (next y7 y6) 
        (next y8 y7)
        (next y9 y8)
        (next y10 y9)    
    
        (at m1 x9 y3)
        (at m2 x3 y2)
        (at m3 x2 y3)
        (at m4 x3 y6)
        (at m5 x6 y9)
        (at m6 x2 y8)
        (at m7 x9 y8)

        (at c1 x6 y3)
        (at c1 x6 y4)

        (at c2 x6 y5)
        (at c2 x7 y5)

        (at c3 x7 y6)
        (at c3 x7 y7)

        (at c4 x5 y6)
        (at c4 x6 y6)

        (at c5 x4 y4)
        (at c5 x4 y5)
        
        (at c6 x4 y9)
        (at c6 x4 y10)

        (at red x5 y4)
        (at red x5 y5)
        
        
        
        (at t1 x3 y3)
        (at t1 x4 y3)
        (at t1 x5 y3)

        (at t2 x4 y6)
        (at t2 x4 y7)
        (at t2 x4 y8)

        (at t3 x6 y8)
        (at t3 x7 y8)
        (at t3 x8 y8)

        (at t4 x9 y5)
        (at t4 x9 y6)
        (at t4 x9 y7)

        (occupied x9 y3)
        (occupied x3 y2)
        (occupied x2 y3)
        (occupied x3 y6)
        (occupied x6 y9)
        (occupied x2 y8)
        (occupied x9 y8)
        (occupied x6 y3)
        (occupied x6 y4)
        (occupied x6 y5)
        (occupied x7 y5)
        (occupied x7 y6)
        (occupied x7 y7)
        (occupied x5 y6)
        (occupied x6 y6)
        (occupied x4 y4)
        (occupied x4 y5)       
        (occupied x5 y4)
        (occupied x5 y5)
        (occupied x3 y3)
        (occupied x4 y3)
        (occupied x5 y3)
        (occupied x4 y6)
        (occupied x4 y7)
        (occupied x4 y8)
        (occupied x6 y8)
        (occupied x7 y8)
        (occupied x8 y8)
        (occupied x9 y5)
        (occupied x9 y6)
        (occupied x9 y7)
        (occupied x4 y9)
        (occupied x4 y10)
        
    )

    (:goal
        (at red x5 y9)
    )

)

; plan
1. (move-motorcycle-hor m7 x9 y8 y9)
   deleted: (at m7 x9 y8) (occupied x9 y8)
   added: (at m7 x9 y9) (occupied x9 y9)
   goals met: 0 of 1
2. (move-truck-ver t3 y8 x6 x7 x8 x9)
   deleted: (at t3 x6 y8) (occupied x6 y8)
   added: (at t3 x9 y8) (occupied x9 y8)
   goals met: 0 of 1
3. (move-truck-ver t3 y8 x7 x8 x9 x10)
   deleted: (at t3 x7 y8) (occupied x7 y8)
   added: (at t3 x10 y8) (occupied x10 y8)
   goals met: 0 of 1
4. (move-car-hor c3 x7 y6 y7 y8)
   deleted: (at c3 x7 y6) (occupied x7 y6)
   added: (at c3 x7 y8) (occupied x7 y8)
   goals met: 0 of 1
5. (move-car-ver c4 y6 x5 x6 x7)
   deleted: (at c4 x5 y6) (occupied x5 y6)
   added: (at c4 x7 y6) (occupied x7 y6)
   goals met: 0 of 1
6. (move-car-hor red x5 y4 y5 y6)
   deleted: (at red x5 y4) (occupied x5 y4)
   added: (at red x5 y6) (occupied x5 y6)
   goals met: 0 of 1
7. (move-car-hor red x5 y5 y6 y7)
   deleted: (at red x5 y5) (occupied x5 y5)
   added: (at red x5 y7) (occupied x5 y7)
   goals met: 0 of 1
8. (move-car-hor red x5 y6 y7 y8)
   deleted: (at red x5 y6) (occupied x5 y6)
   added: (at red x5 y8) (occupied x5 y8)
   goals met: 0 of 1
9. (move-car-hor red x5 y7 y8 y9)
   deleted: (at red x5 y7) (occupied x5 y7)
   added: (at red x5 y9) (occupied x5 y9)
   goals met: 1 of 1
